{
  "id": "select-queries",
  "heading": "SELECT Queries – Basic and Advanced",
  "blocks": [
    {
      "text": "SELECT queries are the foundation of SQL. They allow you to retrieve specific data from one or more tables in a database."
    },
    {
      "list": [
        "SELECT * FROM table_name – retrieves all columns",
        "SELECT column1, column2 – retrieves specific columns",
        "WHERE clause – filter rows based on conditions",
        "ORDER BY – sort results ascending or descending",
        "LIMIT / OFFSET – control the number of rows returned"
      ]
    },
    {
      "text": "Let's see a basic example:"
    },
    {
      "code": [
        {
          "language": "sql",
          "content": "SELECT name, email FROM Users WHERE status = 'active' ORDER BY name ASC LIMIT 10;"
        }
      ]
    },
    {
      "text": "Now, to make it more real-world, imagine a company with thousands of users and millions of transactions. Efficient SELECT queries allow managers to get insights quickly."
    },
    {
      "badge": "success",
      "title": "Pro Tip",
      "text": "Always select only the columns you need. Using SELECT * may impact performance in large tables."
    },
    {
      "text": "Advanced SELECT usage includes:"
    },
    {
      "list": [
        "Using functions in SELECT: CONCAT(), LENGTH(), UPPER(), LOWER()",
        "Using subqueries: SELECT * FROM Orders WHERE user_id IN (SELECT id FROM Users WHERE status='active')",
        "Combining results with UNION or UNION ALL",
        "Conditional selection with CASE statements"
      ]
    },
    {
      "code": [
        {
          "language": "sql",
          "content": "SELECT id, name,\n       CASE WHEN balance > 1000 THEN 'VIP' ELSE 'Regular' END AS user_type\nFROM Users;"
        }
      ]
    },
    {
      "image": {
        "src": "https://via.placeholder.com/800x400?text=SELECT+Queries+Flow",
        "alt": "SQL SELECT Flow",
        "caption": "Flow of a SELECT query through the query processor and database engine."
      }
    },
    {
      "text": "Mini Exercise: Retrieve the top 5 users with the highest order amounts, but exclude inactive users. Think about which clauses you would use (WHERE, ORDER BY, LIMIT)."
    },
    {
      "text": "Explanation for beginners: Every SQL query has three phases: Parsing → Optimization → Execution. Understanding this helps in writing efficient queries, especially in large-scale systems."
    },
    {
      "text": "We can also use JOINs within SELECT queries to combine data from multiple tables. We'll cover JOINs in the next subtopic."
    }
  ]
}
